"use strict";

// Змінні, оголошені як const, обов'язково повинні бути ініціалізовані
// значенням під час оголошення, інакше виникне помилка.
const yearOfBirth = 306;
console.log(yearOfBirth);

// Змінним, оголошеним через let, не обов'язково одразу присвоювати значення.
let age;

// Якщо змінній, оголошеній як let, не було присвоєно значення,
// вона ініціалізується спеціальним значенням undefined (не визначено).
console.log(age); // undefined

// console.log() - це метод для виведення даних у консоль браузера,
// пізніше познайомимось з ним детальніше.

// Якщо змінна оголошена як let, її значення можна перезаписати.
age = 14;
console.log(age); // 14

// title = 15;
